getting_started_with_ipython/slides.org
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+BEAMER_FRAME_LEVEL: 1

#+BEAMER_HEADER_EXTRA: \usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_envargs(Env Args) %4BEAMER_col(Col) %8BEAMER_extra(Extra)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0 :ETC

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]

#+LaTeX_HEADER: \usepackage[english]{babel} \usepackage{ae,aecompl}
#+LaTeX_HEADER: \usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}

#+LaTeX_HEADER:\usepackage{listings}

#+LaTeX_HEADER:\lstset{language=Python, basicstyle=\ttfamily\bfseries,
#+LaTeX_HEADER:  commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
#+LaTeX_HEADER:  showstringspaces=false, keywordstyle=\color{blue}\bfseries}

#+TITLE:    Getting Started -- ~ipython~
#+AUTHOR:    FOSSEE
#+EMAIL:     
#+DATE:    

#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:nil pri:nil tags:not-in-toc

* Outline
  + invoke the ~ipython~ interpreter
  + quit the ~ipython~ interpreter
  + navigate in the history of ~ipython~
  + use tab-completion
  + look-up documentation of functions
  + interrupt incomplete or incorrect commands
* Question 1
  Type =ab= and hit tab to see what happens. Next, just type =a= and
  hit tab to see what happens.
* Solution 1
  =ab= tab completes to =abs= and =a<tab>= gives us a list of all the
  commands starting with a.
* Question 2
  Look-up the documentation of =round= and see how to use it.
* Solution 2
  =round?=
* Question 3
  Check the output of
  #+begin_src python
    round(2.48)
    round(2.48, 1)
    round(2.48, 2)
    
    round(2.484)
    round(2.484, 1)
    round(2.484, 2)
  #+end_src 
  Look-up the documentation of =round= and see how to use it.
* Solution 3
  We get 2.0, 2.5 and 2.48, which are what we expect. 
* Question 4
  Try typing =round(2.484=, and hit enter. and then cancel the command
  using Ctrl-C. Then, type the command, =round(2.484, 2)= and resume
  the video.
* Solution 4
  #+begin_src python
    round(2.484 
    ^C
    
    round(2.484, 2)
  #+end_src 



* Summary
  + invoking and quitting the ~ipython~ interpreter
  + navigating the history
  + using tab-completion to work faster
  + looking-up documentation using ~?~
  + sending keyboard interrupts using ~Ctrl-C~

* Thank you!
#+begin_latex
  \begin{block}{}
  \begin{center}
  This spoken tutorial has been produced by the
  \textcolor{blue}{FOSSEE} team, which is funded by the 
  \end{center}
  \begin{center}
    \textcolor{blue}{National Mission on Education through \\
      Information \& Communication Technology \\ 
      MHRD, Govt. of India}.
  \end{center}  
  \end{block}
#+end_latex


