getting_started_with_ipython/slides.tex
% Created 2010-12-18 Sat 12:23
\documentclass[presentation]{beamer}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{t1enc}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[english]{babel} \usepackage{ae,aecompl}
\usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}
\usepackage{listings}
\lstset{language=Python, basicstyle=\ttfamily\bfseries,
commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
showstringspaces=false, keywordstyle=\color{blue}\bfseries}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Getting Started -- \texttt{ipython}}
\author{FOSSEE}
\date{}

\usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
\begin{document}

\maketitle









\begin{frame}
\frametitle{Outline}
\label{sec-1}

\begin{itemize}
\item invoke the \texttt{ipython} interpreter
\item quit the \texttt{ipython} interpreter
\item navigate in the history of \texttt{ipython}
\item use tab-completion
\item look-up documentation of functions
\item interrupt incomplete or incorrect commands
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Question 1}
\label{sec-2}

  Type \texttt{ab} and hit tab to see what happens. Next, just type \texttt{a} and
  hit tab to see what happens.
\end{frame}
\begin{frame}
\frametitle{Solution 1}
\label{sec-3}

  \texttt{ab} tab completes to \texttt{abs} and \texttt{a<tab>} gives us a list of all the
  commands starting with a.
\end{frame}
\begin{frame}
\frametitle{Question 2}
\label{sec-4}

  Look-up the documentation of \texttt{round} and see how to use it.
\end{frame}
\begin{frame}
\frametitle{Solution 2}
\label{sec-5}

  \texttt{round?}
\end{frame}
\begin{frame}[fragile]
\frametitle{Question 3}
\label{sec-6}

  Check the output of
\begin{verbatim}
round(2.48)
round(2.48, 1)
round(2.48, 2)

round(2.484)
round(2.484, 1)
round(2.484, 2)
\end{verbatim}
  Look-up the documentation of \texttt{round} and see how to use it.
\end{frame}
\begin{frame}
\frametitle{Solution 3}
\label{sec-7}

  We get 2.0, 2.5 and 2.48, which are what we expect. 
\end{frame}
\begin{frame}
\frametitle{Question 4}
\label{sec-8}

  Try typing \texttt{round(2.484}, and hit enter. and then cancel the command
  using Ctrl-C. Then, type the command, \texttt{round(2.484, 2)} and resume
  the video.
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 4}
\label{sec-9}

\begin{verbatim}
round(2.484 
^C

round(2.484, 2)
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Summary}
\label{sec-10}

\begin{itemize}
\item invoking and quitting the \texttt{ipython} interpreter
\item navigating the history
\item using tab-completion to work faster
\item looking-up documentation using \texttt{?}
\item sending keyboard interrupts using \texttt{Ctrl-C}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Thank you!}
\label{sec-11}

  \begin{block}{}
  \begin{center}
  This spoken tutorial has been produced by the
  \textcolor{blue}{FOSSEE} team, which is funded by the 
  \end{center}
  \begin{center}
    \textcolor{blue}{National Mission on Education through \\
      Information \& Communication Technology \\ 
      MHRD, Govt. of India}.
  \end{center}  
  \end{block}
\end{frame}

\end{document}
